app/app/Controllers/Admin_controller.php

                         ->findAll();

        // Obtener todas las categorías para el select
        $categorias = $categoriasModel->findAll();
---
SELECT *
FROM `categorias`