app/Controllers/Admin_controller.php

    public function listar_ventas(){
        $ventasModel = new Ventas_Model();
        $personaModel = new Personas_Model();

        // Obtener todas las ventas con los datos del cliente, ordenadas por fecha descendente
        $ventas = $ventasModel->select('venta.*, personas.dni, personas.persona_nombre, personas.persona_apellido')
                            ->join('personas', 'personas.id = venta.id_persona')
                            ->orderBy('venta.fecha_venta', 'DESC')
                            ->findAll();
---
SELECT `venta`.*, `personas`.`dni`, `personas`.`persona_nombre`, `personas`.`persona_apellido`
FROM `venta`
JOIN `personas` ON `personas`.`id` = `venta`.`id_persona`
ORDER BY `venta`.`fecha_venta` DESC

    public function detalle_venta($id){
        $ventaModel = new Ventas_Model();
        $detalleModel = new Detalle_Venta_Model();
        $juegosModel = new Videojuegos_Model();
        $personaModel = new Personas_Model();

        // Obtener información de la venta
        $venta = $ventaModel->select('venta.*, personas.persona_nombre, personas.persona_apellido, personas.dni, personas.persona_mail as email, personas.domicilio, personas.codigo_postal')
                          ->join('personas', 'personas.id = venta.id_persona')
                          ->find($id);

        if (!$venta) {
            return redirect()->to('/listar_ventas')->with('error', 'Venta no encontrada');
        }

        // Obtener detalles de la venta
        $detalles = $detalleModel->where('id_venta', $id)->findAll();
        $subtotal = 0;

        // Obtener nombres de juegos y calcular subtotal
        foreach ($detalles as &$juego) {
            $titulo = $juegosModel->find($juego['id_videojuego']);
---
SELECT `venta`.*, `personas`.`persona_nombre`, `personas`.`persona_apellido`, `personas`.`dni`, `personas`.`persona_mail` as `email`, `personas`.`domicilio`, `personas`.`codigo_postal`
FROM `venta`
JOIN `personas` ON `personas`.`id` = `venta`.`id_persona`
WHERE `venta`.`id_venta` = '11'
SELECT *
FROM `videojuegos`
WHERE `videojuegos`.`id_videojuego` = '2'