app/Controllers/Videojuegos_controller.php

    public function catalogo_cliente(){
        $modelo = new Videojuegos_Model();

        $data['videojuegos'] = $modelo->where('estado_videojuego', 1)->findAll(); // Trae todos los juegos activos
---
SELECT *
FROM `videojuegos`
WHERE `estado_videojuego` = 1