app/Controllers/Videojuegos_controller.php

    public function form_editar_videojuego($id){
        $model = new Videojuegos_model();
        $categoria = new Categorias_model();

        $data['videojuego'] = $model->find($id);
        $data['categoria'] = $categoria->findAll();
---
SELECT *
FROM `categorias`

    public function catalogo_cliente(){
        $modelo = new Videojuegos_Model();
        $data['videojuegos'] = $modelo->findAll(); // Trae todos los registros
---
SELECT *
FROM `videojuegos`